---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DoorConstructionType
source: html/282c8fea-e410-3a4f-22f2-5b14e07d41af.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DoorConstructionType Property

"Construction Type"

## Syntax (C#)
```csharp
public static ForgeTypeId DoorConstructionType { get; }
```